[{"ENTITY_1": "NOW Supplements", "CONNECTION": "has rating", "ENTITY_2": "4.0"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has rating", "ENTITY_2": "5.0"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has rating", "ENTITY_2": "3.0"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "Good"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "Great product"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "This just arrived promptly. I ordered it, because my mother's eye doctor told her that her cataract had disappeared to their amazement. She told him she'd been taking eyebright, so she didn't have to have surgery. That's all I know about it."}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "MY EYESIGHT HAS IMPROVED, HOWEVER I AM NOT SURE IF IT IS FROM THIS PRODUCT!"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "It arrived promptly and was as displayed."}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "I frequently experience bleeding from weak capillaries in my eyes. I purchased it to see if it would strengthen those capillaries, but it's too soon to report on the outcome on this product as yet."}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "Great product. Always fresh. Smells good. Tastes good. Works. Eyes improve considerably when using this product."}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "I've only been taking this for about a week now but I've already seeing improvements in a few different ways. First off, I can tell my vision has become a little bit clearer (I'm somewhat near-sighted but I don't use any kind of vision correction). My my eyes have gotten a bit brighter since I started taking it. The biggest improvement I've seen actually isn't vision related at all. As well as eye related issues eyebright has also been used in the past to treat allergies, which I have quite severely. As of today I took an over the counter allergy pill, I'll explain this statement. The day before yesterday I didn't take my allergy pill just to see if I could tell the difference with just the eyebright. I didn't sneeze any more than with my pill. Yesterday I took my pill and 45 min. later had a 15 min. sneezing fit. I didn't take my pill today and am just fine. Eyebright also contains many vitamins so it's almost like a multi vitamin. There potentially many benefits for anyone thinking about taking eyebright, some of which may surprise you. As a side note, the NOW brand of vitamins is the best price+quality that I have found."}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "great for the eyes! increasing the strength of vision for my eyes and the clarity of my vison has improved"}, {"ENTITY_1": "NOW Supplements", "CONNECTION": "has review", "ENTITY_2": "I use Eyebright for my allergies. It relieves my allergies helping me not to so stuffy in my nose. Helps open my nasal passages."}]