[{"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has rating", "ENTITY_2": "5.0 out of 5"}, {"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has rating", "ENTITY_2": "3.0 out of 5"}, {"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has rating", "ENTITY_2": "5.0 out of 5"}, {"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has review", "ENTITY_2": "Will buy again"}, {"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has review", "ENTITY_2": "... didn't have any issues with the softgels sticking together like other reviewers"}, {"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has review", "ENTITY_2": "The eight month supply is great because I don't have to worry about running out ..."}, {"ENTITY_1": "VitaCause VITAMIN D3 5000IU 240 Softgels", "CONNECTION": "has review", "ENTITY_2": "These vitamins have really been helping me with my hair it was getting very brittle and after taking these vitamins for a couple of weeks I can feel my hair feeling thicker and stronger. The eight month supply is great because I don't have to worry about running out soon. The pills are very tiny and are great for people who have a hard time swallowing pills. I received this product for free or at a discounted price in exchange for my honest and unbiased review. All opinions expressed are solely my own and only after trying out the product. How I rank products (with Amazon's ratings in parenthesis): * 1 star (I hate it!): I would either return or throw away this product. It was a waste of my money and not functional. ** 2 star (I don’t like it): I'm not a fan of this item and I won't order it again, but it has at least one positive quality. *** 3 star (It’s ok): This item has both positive and negative qualities. It may work for some people, but I wouldn't go out of my way to purchase or recommend it. **** 4 star (I like it): This item arrived and functions as advertised. I would change a few things about this, but is a good product overall. I would use this item. ***** 5 star (I love it!): This item is AWESOME. I will use it and recommend it to others! I just LOVE it! It works as advertised and is an all-around great product."}]